#+STARTUP: fold
# 记录将来要做的事情
* DEFFERED Emacs: 显示elisp片段中的变量值
:LOGBOOK:
- State "DEFFERED"   from "DONE"       [2022-04-18 Mon 11:40]
:END:
* DEFFERED 折腾 AutoHotKey (应用打开/聚焦，窗口布局)
* DEFFERED Makefile 学习
:LOGBOOK:
- State "DEFFERED"   from "TODO"       [2022-04-18 Mon 11:40]
:END:
* DEFFERED 编程之美 - 1.2中国象棋将帅问题总结
:LOGBOOK:
- State "DEFFERED"   from "NEXT"       [2022-04-18 Mon 11:37]
CLOCK: [2022-04-14 Thu 16:10]--[2022-04-14 Thu 16:14] =>  0:04
CLOCK: [2022-04-11 Mon 16:55]--[2022-04-11 Mon 17:47] =>  0:52
:END:

* DEFFERED 从零开始学架构:基础架构
:LOGBOOK:
- State "DEFFERED"   from "NEXT"       [2022-04-14 Thu 00:13]
CLOCK: [2022-04-09 Sat 15:56]--[2022-04-09 Sat 17:07] =>  1:11
:END:

* DEFFERED Oral English：痘痘护理
DEADLINE: <2022-04-13 Wed 23:00>
:LOGBOOK:
- State "DEFFERED"   from "NEXT"       [2022-04-14 Thu 00:12]
CLOCK: [2022-04-11 Mon 22:03]--[2022-04-11 Mon 22:19] =>  0:16
- Note taken on [2022-04-11 Mon 10:37] \\
  [https://www.bilibili.com/video/BV1gK4y147wf]
:END:
* DEFFERED 普通话练习：白杨礼赞后半段
DEADLINE: <2022-04-13 Wed 22:00>
:LOGBOOK:
- State "DEFFERED"   from "DONE"       [2022-04-14 Thu 00:12]
- State "WAITING"    from "TODO"       [2022-04-14 Thu 00:12]
:END:
* TODO [#A] 以"个人GTD系统设计"总结架构思路
* NEXT 数电模拟器代码 && 汉诺塔递归/非递归代码 并使用gtd调试
:LOGBOOK:
CLOCK: [2022-04-19 Tue 12:26]--[2022-04-19 Tue 12:44] =>  0:18
CLOCK: [2022-04-19 Tue 11:44]--[2022-04-19 Tue 11:55] =>  0:11
CLOCK: [2022-04-19 Tue 10:25]--[2022-04-19 Tue 11:22] =>  0:57
CLOCK: [2022-04-19 Tue 07:07]--[2022-04-19 Tue 07:54] =>  0:47
:END:
* NEXT C算法:数和二叉树
SCHEDULED: <2022-04-09 Sat>
:LOGBOOK:
CLOCK: [2022-04-09 Sat 13:22]--[2022-04-09 Sat 14:07] =>  0:45
:END:
1. [ ] 插入节点函数
* NEXT 读《牧羊少年的奇幻之旅》
:LOGBOOK:
CLOCK: [2022-04-20 Wed 11:50]--[2022-04-20 Wed 12:00] =>  0:10
:END:
* NEXT 操作系统第三课:看视频，记笔记
:LOGBOOK:
CLOCK: [2022-04-22 Fri 16:50]--[2022-04-22 Fri 17:54] =>  1:04
:END:
* NEXT 错单管理研究分析
